'use strict'

// Дан массив [1, 2, 3]. Додайте йому у кінець елементи 4, 5, 6
// Дан массив [1, 2, 3]. Додайте йому у початок елементи4, 5, 6.
const numbers = [1, 2, 3]

numbers.push(4, 5, 6)
numbers.unshift(4, 5, 6)

// Дан массив ['js', 'css', 'jq']. Виведіть на екран перший елемент
// Дан массив ['js', 'css', 'jq']. Виведіть на екран останній елемент
const abc = ['js', 'css', 'jq']

document.write(abc.shift())
document.write(abc.pop())

// Дан массив [1, 2, 3, 4, 5]. За допомогою методу  slice запишіть нові елементи [1, 2, 3].
// Дан массив [1, 2, 3, 4, 5]. За допомогою методу slice запишіть нові елементи [4, 5].
const acb = [1, 2, 3, 4, 5]

 document.write(acb.slice(0,3))
 document.write(arr.slice(3))